Haaii, pada kesempatan kali ini, saya akan share sedikit ilmu pengetahuan mengenai dataframe. kenapa harus dataframe ? karena menurut saya, format dataframe ini paling mudah dimengerti dibanding format lainnya untuk melakukan kegiatan analisis data, seperti membuat visualisasi, dan lain sebagainya. oke kita langsung saja mulai..

## 1. membuat dataframe

sebelum membuat dataframe, pastikan dulu untuk memanggil library pandasnya yak.. untuk membuat dataframe, formatnya cukup mudah

In [1]:
import pandas as pd

In [ ]:
'''
df = pd.DataFrame({'nama_kolom_1' : datanya
                   'nama_kolom_2' : datanya
                   'nama_kolom_n' : datanya})
'''

data yang dibutuhkan untuk kolom dataframe dapat berupa format data list

In [8]:
# contoh
df = pd.DataFrame({'nama_siswa' : ['andi','citra','baayu','jack','gilbert',
                                   'stefa','rei','baim','intan','melati'],
                   'mata_kuliah': ['statistika']*10,
                   'nilai' : [90,80,60,68,84,
                              86,98,100,85,98]})
display(df)

  nama_siswa mata_kuliah  nilai
0       andi  statistika     90
1      citra  statistika     80
2      baayu  statistika     60
3       jack  statistika     68
4    gilbert  statistika     84
5      stefa  statistika     86
6        rei  statistika     98
7       baim  statistika    100
8      intan  statistika     85
9     melati  statistika     98

untuk dataframe pada python, index barisnya dimulai dari 0, jadi untuk keseluruhan barisnya adalah **n + 1**, apabila pada baris akhirnya menunjukkan angka 9, maka total barisnya adalah 10

misalkan, ternyata nilai jack salah input, seharusnya nilai dia adalah 82, maka untuk mengganti nilainya dapat dilakukan dengan method .replace, yaitu :

In [19]:
df['nilai'] = df['nilai'].replace(['68'],'82')

display(df)

  nama_siswa mata_kuliah  nilai
0       andi  statistika     90
1      citra  statistika     80
2      baayu  statistika     60
3       jack  statistika     82
4    gilbert  statistika     84
5      stefa  statistika     86
6        rei  statistika     98
7       baim  statistika    100
8      intan  statistika     85
9     melati  statistika     98

method lainnya pada dataframe dapat dilihat pada link [berikut](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html)